Autodesk.Revit.DB.Analysis.EnergyDataSettings.SetCreateAnalyticalModel(System.Boolean)
If this is true, data, features, and geometry related to the Energy Analytical Model
will be created, allowing the energy performance to be analyzed through GreenBuilidingXML.
createAnalyticalModel:
True to enable the Energy Analytical Model otherwise.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.GetBuildingConstructionSetElementId(Autodesk.Revit.DB.Document)
Id of the building construction set.
Remarks:
The building construction set is the default
project construction set used when spaces are not assigned a
construction.
Returns:
Returns the id of the building construction set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.EnableConceptualEnergyAnalyticalModel
Turns on functionality related to conceptual energy analysis.
Returns:
Returns true if the Conceptual Energy Analytical model is turned on, false otherwise.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckAnalysisType(Autodesk.Revit.DB.Analysis.AnalysisMode)
Checks that the analysis type falls within an appropriate range.
analysisType:
The analysis type to be checked.
Returns:
True if the analysis type falls within an appropriate range, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckBuildingEnvelope(Autodesk.Revit.DB.Analysis.gbXMLExportBuildingEnvelope)
Checks that the building envelope determination method falls within an appropriate range.
determinationMethod:
The building envelope determination method to be checked.
Returns:
True if the building envelope determination method falls within an appropriate range, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckServiceType(Autodesk.Revit.DB.Analysis.gbXMLServiceType)
Checks that the service type falls within an appropriate range.
serviceType:
The service type to be checked.
Returns:
True if the service type falls within an appropriate range, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckBuildingType(Autodesk.Revit.DB.Analysis.gbXMLBuildingType)
Checks that the building type falls within an appropriate range.
buildingType:
The building type to be checked.
Returns:
True if the building type falls within an appropriate range, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckBuildingHVACSystem(Autodesk.Revit.DB.Analysis.gbXMLBuildingHVACSystem)
Checks that the building HVAC system falls within an appropriate range.
buildingHVACSystem:
The building HVAC system to be checked.
Returns:
True if the building HVAC system falls within an appropriate range, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckBuildingOperatingSchedule(Autodesk.Revit.DB.Analysis.gbXMLBuildingOperatingSchedule)
Checks that the building operating schedule falls within an appropriate range.
buildingOperatingSchedule:
The building operating schedule to be checked.
Returns:
True if the building operating schedule falls within an appropriate range, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckProjectReportType(Autodesk.Revit.DB.Analysis.HVACLoadLoadsReportType)
Checks that the project report type falls within an appropriate range.
projectReportType:
The project report type to be checked.
Returns:
True if the project report type falls within an appropriate range, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckBuildingConstructionClass(Autodesk.Revit.DB.Analysis.HVACLoadConstructionClass)
Checks that the building construction class falls within an appropriate range.
buildingConstructionClass:
The building construction class to be checked.
Returns:
True if the building construction class falls within an appropriate range, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckExportComplexity(Autodesk.Revit.DB.Analysis.gbXMLExportComplexity)
Checks that the export complexity falls within an appropriate range.
exportComplexity:
The export complexity to be checked.
Returns:
True if the export complexity falls within an appropriate range, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckProjectPhase(Autodesk.Revit.DB.ElementId)
Checks that the input element is a project phase.
projectPhaseId:
The element to be checked.
Returns:
True if the input element is a project phase, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckGroundPlane(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
The ground plane should be an Element of type Level.  This method checks to confirm that an ElementId is for a Level element.
ccda:
The Document.
groundPlaneId:
The element id to be checked to confirm that it is suitable to be a ground plane (i.e., that it is a level) or
that it is invalidElementId.  Setting ground plane with invalidElementId will lead to the ground plane being "reset".
Returns:
True if the input element is a level or invalidElementId, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckGroundPlane(Autodesk.Revit.DB.ElementId)
The ground plane should be an Element of type Level.  This method checks to confirm that an ElementId is for a Level element.
groundPlaneId:
The element id to be checked to confirm that it is suitable to be a ground plane (i.e., that it is a level) or
that it is invalidElementId.  Setting ground plane with invalidElementId will lead to the ground plane being "reset".
Returns:
True if the input element is a level or invalidElementId, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckConstructionSetElement(Autodesk.Revit.DB.ElementId)
Checks that the construction set ElementId is acceptable.
constructionSetElementId:
The construction set ElementId to be checked.
Returns:
True if the construction set ElementId is a valid construction set element, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckExportCategory(Autodesk.Revit.DB.ElementId)
Checks whether the export category falls within the list:
OST_RoomsOST_MEPSpaces
exportCategoryId:
The export category to be checked.
Returns:
True if the export category falls within the list, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckRangeOfMassZoneCoreOffset(System.Double)
Checks that the mass zone core offset is greater than or equal to zero.
massZoneCoreOffset:
The mass zone core offset to be checked.  Should be greater than or equal to zero.
Returns:
True if the mass zone core offset is greater than or equal to zero, false otherwise.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckRangeOfSkylightWidth(System.Double)
Checks that the skylight width is greater than or equal to eight inches.
skylightWidth:
The skylight width to be checked.  Should be greater than or equal to eight inches.
Returns:
True if the skylight width is greater than or equal to eight inches, false otherwise.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckRangeOfPercentageSkylights(System.Double)
Checks that the percentage skylights value is between 0.00 and 0.95.
percentageSkylights:
The percentage skylights to be checked.
Returns:
True if the percentage skylights value is between 0.00 and 0.95, false otherwise.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckRangeOfShadeDepth(System.Double)
Checks that the shade depth is greater than or equal to zero.
shadeDepth:
The shade depth to be checked.
Returns:
True if the shade depth is greater than or equal to zero, false otherwise.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckRangeOfSillHeight(System.Double)
Checks that the sill height is greater than or equal to zero.
sillHeight:
The sill height to be checked.
Returns:
True if the sill height falls is greater than or equal to zero, false otherwise.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckRangeOfPercentageGlazing(System.Double)
Checks that the percentage glazing value is between 0.00 and 0.95.
percentageGlazing:
The percentage glazing to be checked.
Returns:
True if the percentage glazing value is between 0.00 and 0.95, false otherwise.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.CheckRangeOfSliverSpaceTolerance(System.Double)
Checks that the sliver space tolerance is greater than or equal to zero.
silverSpaceTolerance:
The sliver space tolerance to be checked.
Returns:
Returns true if the sliver space tolerance is greater than or equal to zero, false otherwise.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.IsDocumentUsingEnergyDataAnalyticalModel(Autodesk.Revit.DB.Document)
Get EnergyDataSettings element and if it exists, return result from getCreateAnalyticalModel.
ccda:
The document.
Returns:
Returns true if the Conceptual Energy Analytical Model is enabled, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.GetFromDocument(Autodesk.Revit.DB.Document)
Every project document has a EnergyDataSettings element.
Family documents do not have EnergyDataSettings elements.
cda:
The document.
Returns:
Returns the EnergyDataSettings element or NULL.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.DividePerimeter
If this is true, zones with exterior boundaries on each floor of the building will be divided based on geometric criteria.
Remarks:
When the AnalysisType is ConceptualMasses, the division of the perimeter zones is based on the four compass directions.
The quadrants will be True N, S, E, and W. The division of the quadrants will be along the axis of True NW to SE and True SW to NE.
The intersection of the quadrants will be placed at the centroid of the zone.
When the AnalysisType is not ConceptualMasses, the division of the perimeter zones is based on the difference of orientation, maximum length and depth.
Any exterior surfaces that have an angle of 45 degrees or more between them will be divided into separate zones.
Zones greater than 50 ft. will be divided equally. The CoreOffset will determine the depth of the zones.
The purpose of these divisions is to ensure that auto-generated zoning is appropriate for thermal loads generated by the relative position of the building to the sun path.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.EnergyModel
if this is on there should be an energy model dependent on the current AnalysisType
if it is off the conceptual energy model should be turned off
but setting this datum does not do the work, just reflects the state.
true if energy model is on, false otherwise
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.BuildingType
The type of building.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The building type does not fall within an appropriate range.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.CoreOffset
The default offset used to determine the outer perimeter to be divided into zones.
Remarks:
A Zone can be either a Mass Zone or an Analytical Space depending on whether the AnalysisType is ConceptualMasses or otherwise.
Specifying a value here determines the zone depth and creates a core zone.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for coreOffset must be between 0 and 30000 feet.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.IsExportMullionsEnabled
Indicates if mullions are included in GreenBuildingXML export of the detailed model.
Remarks:
Result is based on the ExportComplexity setting.
When this setting is on, mullions will be exported as shading surfaces. A "simplified" analytical
shading surface is produced from a mullion based on its centerline, thickness, and offset.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.IsExportSimplifiedCurtainSystemsEnabled
Indicates if curtain system geometry is being simplified for GreenBuildingXML export of the detailed model.
Remarks:
Result is based on the ExportComplexity setting.
Curtain Walls and Curtain Systems are normally exported as multiple openings, panel by panel, while for
energy analysis this can be more simply represented as a single glass surface as large as the entire curtain wall/system.
Normally, a curtain wall with 50 panels would be exported as 50 openings.  Often, exporting a single opening with
the total curtain system area is more appropriate.  When this setting is on, one "large" window/opening will be
exported for a curtain wall/system.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.IsExportShadingSurfacesEnabled
Indicates if "shading surfaces" are included in GreenBuildingXML export of the detailed model.
Remarks:
Result is based on the ExportComplexity setting.
The method described by gbs/gbxml.org to calculate the shading surfaces is to
take all surfaces from the MEP spaces, subtract them from the surfaces from all building elements,
and then the remaining surfaces are considered to be the shading surfaces.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.AnalyticalGridCellSize
The cell size for the uniform cubical grid used when computing the building envelope
Remarks:
This is the size of the "cubes" used to divide the building shell
bounding box into a uniform cubical 3D grid.
Since:
2015

Autodesk.Revit.DB.Analysis.EnergyDataSettings.BuildingEnvelopeDeterminationMethod
Indicates if an analysis should be perform to find the model elements that are part of the building envelope
Remarks:
The analysis is performed for the detailed GreenBuildingXML export and in heating and cooling load calculations.
This method uses a combination of ray-casting and flood-fill algorithms in order to find the building elements that are
exposed to the outside of the building. Analytical surface originated from the building elements in the envelope
will be classified as exterior or shading surfaces.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The building envelope determination method does not fall within an appropriate range.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Analysis.EnergyDataSettings.IncludeThermalProperties
Indicates if thermal information from model assemblies and components is included in GreenBuildingXML export of the detailed model.
Remarks:
If true, Revit will include model thermal data from assemblies and
components when available, when Export Category is Rooms.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.UseAirChangesPerHour
True if user is specifying air changes per hour, false otherwise.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.UseOutsideAirPerArea
True is user is specifying outside air per area, false otherwise.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.UseOutsideAirPerPerson
True if user is specifying outside air per person, false otherwise.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.MassZoneDividePerimeter
If this is true, outward facing zones on each floor of the building will be divided based on the four compass directions.
Remarks:
The quadrants will be True N, S, E, and W. The division of the quadrants will be along the axis of True NW
to SE and True SW to NE. The intersection of the quadrants will be placed at the centroid of the zone.
The purpose of these divisions is to ensure that auto-generated zoning is appropriate for thermal loads
generated by the relative position of the building to the sun path.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.IsGlazingShaded
If this is true, glazing/windows that are auto-created on exterior walls will automatically
have a shading device created on their top edge.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.CreateAnalyticalModel
If this is true, data, features, and geometry related to the Energy Analytical Model
will be created, allowing the energy performance to be analyzed through GreenBuilidingXML.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.UseHeatingCredits
If true, Revit will use heating credits in the final load sum calculations.
If false, Revit will ignore heating credits in the final load sum calculations.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.ExportDefaults
Use for detailed model GreenBuildingXML export.
When this setting is true, all building and space defaults, schedules, and constructions will be exported to GreenBuildingXML.
When this setting is false, only values that are specified on the zone or space will be exported to GreenBuildingXML.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.ServiceType
The type of heating or cooling system.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The service type does not fall within an appropriate range.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.BuildingTypeId
The building type element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.AnalysisType
The type of analysis mode.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The analysis type does not fall within an appropriate range.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.ProjectPhase
The project phase of the EnergyData information.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input element is not a project phase.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.GroundPlane
Id of level which represents ground level.
Remarks:
The ground plane defines what is above and below ground for Conceptual Energy Analysis.
The ground plane can optionally used for the rendering cast shadows.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The input element is not a level or invalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.ExportCategory
Value is a category indicating which discipline model will be used for GreenBuildingXML export.
Remarks:
OST_Rooms will use the architectural 3d rooms for export.
OST_MEPSpaces will use the MEP 3d Spaces for export.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The export category is neither OST_Rooms nor OST_MEPSpaces.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.BuildingHVACSystem
The type of HVAC system used by the building for conceptual model energy calculations.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The building HVAC system does not fall within an appropriate range.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.BuildingOperatingSchedule
The operating schedule of the building used for conceptual model energy calculations.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The building operating schedule does not fall within an appropriate range.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.ProjectReportType
Report type: None, simple, standard, detailed
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The project report type does not fall within an appropriate range.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.BuildingConstructionClass
Used for both the detailed and conceptual energy model
Construction class of building as defined by:
loose, medium, tight, or none.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The building construction class does not fall within an appropriate range.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.ExportComplexity
Value determines Export Complexity for GreenBuildingXML detailed model export.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The export complexity does not fall within an appropriate range.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.OutsideAirChangesRatePerHour
The number of times the volume of air interchanges in the room in one hour.
Remarks:
Air Changes per hour is "unitless". It is a number.
It is the number of times the air (the volume) interchanges in the room in one hour.
This number is a format for expressing the requirement for airflow.
The "flow" requirement for a room might be expressed, e.g.,
one room of 100 CF, and 3 Air Changes per Hour (ACH), would compute to 100 CF x 3 ACH / 60 min = 5 CFM.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The outside airChangesRatePerHour does not fall within an appropriate range.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.OutsideAirPerArea
The rate of flow of outside air available per unit area.
Remarks:
Stored in cubic feet per hour per square foot.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The outside airPerArea does not fall within an appropriate range.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.OutsideAirPerPerson
The rate of flow of outside air available per person.
Remarks:
Stored in cubic feet per hour.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The outside airPerPerson does not fall within an appropriate range.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.MassZoneCoreOffset
It defines the default behavior for the automatic generation of Mass Zones
for each Mass Floor in the Project.  Specifying a value here will offset the
outside perimeter of a Mass Zone to create the core.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The mass zone core offset is less than zero.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.SkylightWidth
Used for the conceptual energy model.  The approximate width used for the skylights in
massing instances when the Energy Analytical model is being created.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The skylight width is less than eight inches.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.PercentageSkylights
Used for the conceptual energy model.
The approximate percentage of the building roof surfaces in
massing instances for the Conceptual Energy Analytical Model.
Remarks:
This value is used to automatically model the skylights in
massing instances when the Energy Analytical model is being created.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The percentage skylights value is between 0.00 and 0.95.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.ShadeDepth
Used for the conceptual energy model.
Amount that auto-generated shading will extend from auto-generated windows.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The shade depth is less than zero.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.SillHeight
Used for the conceptual energy model.
The height from the nearest lower level used for auto-glazing created
on walls.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The sill height is less than zero.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.PercentageGlazing
Used for the conceptual energy model.
The approximate percentage of the building exterior wall surfaces
which are covered by windows or other glazing.
Remarks:
This value is used to automatically model these glazed openings in
massing instances for the Conceptual Energy Analytical Model.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The percentage glazing value is not between 0.00 and 0.95.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings.SliverSpaceTolerance
Used for Detailed GreenBuildingXML export.
This value is used to identify sliver spaces, i.e. spaces bounded by parallel surfaces belonging to different rooms.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The sliver space tolerance is less than zero.
Since:
2011

Autodesk.Revit.DB.Analysis.EnergyDataSettings
This element contains settings for gbXML Export and Heating and Cooling Load Calculations
and project level settings for Conceptual Energy Analysis.
for serialization
Since:
2011